first_routes_and_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (WHERE artworks.artist_id = '31' OR artwork_shares.viewer_id = '31')
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artworks.artist_id = '32' OR artwork_shares.viewer_id = '32')
---
  def index
    if params.has_key?(:user_id) # # GET /users/:user_id/artworks
      @artworks = Artwork.joins(:shares)
        .where("artworks.artist_id = ? OR artwork_shares.viewer_id = ?", params[:user_id], params[:user_id])
        # Why do we not get duplicates if an artwork belongs to
        # a user and has been shared with that user?
    else # GET /artworks
      @artworks = Artwork.all

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def show
    @artwork = Artwork.find(params[:id])

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Unbelievable Beavers"], ["image_url", "beavers.jpg"], ["artist_id", 22], ["created_at", "2020-04-23 19:01:17.783673"], ["updated_at", "2020-04-23 19:01:17.783673"]]
---
  def create
    @artwork = Artwork.new(artwork_params)

    if @artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Mona Lisa with eyebrows"], ["updated_at", "2020-04-23 19:23:58.324498"], ["id", 18]]
---
  def update
    @artwork = Artwork.find(params[:id])

    if @artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 18]]
---
  def destroy
    @artwork = Artwork.find(params[:id])
    @artwork.destroy