first_routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # debugger
    @users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Michael Caine"], ["email", ""], ["created_at", "2020-04-22 21:08:11.169107"], ["updated_at", "2020-04-22 21:08:11.169107"]]
---
  def create
    # debugger
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "gosling@canada.gov"], ["updated_at", "2020-04-22 20:49:56.275304"], ["id", 5]]
---
  def update
    # debugger
    @user = User.find(params[:id])

    if @user.update(user_params)